Revit 2026 API

# MEPBuildingConstructionSet Class

---

A set that contains MEPBuildingConstructions.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.MechanicalMEPBuildingConstructionSet

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MEPBuildingConstructionSet : APIObject,
	IEnumerable
```
```vb
Public Class MEPBuildingConstructionSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class MEPBuildingConstructionSet : public APIObject,
	IEnumerable
```
```fsharp
type MEPBuildingConstructionSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The MEPBuildingConstructionSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MEPBuildingConstructionSet | Initializes a new instance of the MEPBuildingConstructionSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Size | Returns the number of MEPBuildingConstructions that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every MEPBuildingConstruction from the set, rendering it empty. |
|  | Contains | Tests for the existence of a MEPBuildingConstruction within the set. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | Erase | Removes a specified MEPBuildingConstruction from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Insert | Insert the specified MEPBuildingConstruction into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace